added updated docs
